# CapWasAddedWarning Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..GenericMEPFailures..::..CapWasAddedWarning Property
BuiltInFailures..::..GenericMEPFailures Class See Also
---
1 cap was added.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CapWasAddedWarning { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CapWasAddedWarning As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CapWasAddedWarning {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..GenericMEPFailures Class
Autodesk.Revit.DB Namespace